#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗапуститьВсеТесты(Команда)
	ЗапуститьВсеТестыНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Тесты выполнены.");
КонецПроцедуры

&НаСервере
Процедура ЗапуститьВсеТестыНаСервере()
	Тесты = ЗапускТестов.ПолучитьДействующиеТесты();
	Для Каждого ТекущийТест Из Тесты Цикл
		ВыполнитьИПроверитьТест(ТекущийТест);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЭталоны(Команда)
	СохранитьЭталоныНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Эталоны успешно сохранены.");
КонецПроцедуры

&НаСервере
Процедура СохранитьЭталоныНаСервере()
	Тесты = ЗапускТестов.ПолучитьДействующиеТесты();
	Для Каждого ТекущийТест Из Тесты Цикл
		СохранитьЭталон(ТекущийТест);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТест(Команда)
	ВыполнитьИПроверитьТест(Тест);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЭталонЗапроса(Команда)
	СохранитьЭталон(Тест);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыполнитьИПроверитьТест(ТекущийТест)
	Перем Результат;
	Результат = ЗапускТестов.ВыполнитьТестовыйЗапрос(ТекущийТест);
	ЗапускТестов.ПроверитьРезультатВыполненияЗапроса(Результат, ТекущийТест);
КонецПроцедуры

&НаСервере
Процедура СохранитьЭталон(ТекущийТест)
	Перем ТестОбъект;
	Перем JSON;
	Перем Результат;
	Результат = ЗапускТестов.ВыполнитьТестовыйЗапрос(Тест);
	ТестОбъект = ТекущийТест.Ссылка.ПолучитьОбъект();
	
	JSON = ЗапускТестов.СериализоватьРезультат(Результат);
	
	ТестОбъект.РезультатЗапроса = JSON;
	ТестОбъект.Записать();
КонецПроцедуры
#КонецОбласти
